src/main/resources/off.sh

curl --http1.0 --user-agent '' --request POST  --header 'Accept: ' --header 'Content-type: text/xml; charset="utf-8"' --header 'SOAPACTION: "'"urn:Belkin:service:basicevent:1#SetBinaryState"'"'  --data '<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:SetBinaryState xmlns:u="urn:Belkin:service:basicevent:1"><BinaryState>0</BinaryState></u:SetBinaryState></s:Body></s:Envelope>' --url "http://192.168.1.109:49153/upnp/control/basicevent1"